{"keras_version": "2.0.4", "backend": "tensorflow", "config": [{"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "conv2d_1", "use_bias": true, "dilation_rate": [1, 1], "batch_input_shape": [null, 48, 48, 1], "activation": "linear", "filters": 64, "padding": "valid", "kernel_constraint": null, "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "bias_constraint": null, "dtype": "float32", "data_format": "channels_last", "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"epsilon": 0.001, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "name": "batch_normalization_1", "gamma_regularizer": null, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "name": "conv2d_2", "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "filters": 64, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"epsilon": 0.001, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "name": "batch_normalization_2", "gamma_regularizer": null, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"padding": "valid", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "max_pooling2d_1", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.6}, "class_name": "Dropout"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "name": "conv2d_3", "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "filters": 32, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"epsilon": 0.001, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "name": "batch_normalization_3", "gamma_regularizer": null, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "name": "conv2d_4", "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "filters": 32, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"epsilon": 0.001, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "name": "batch_normalization_4", "gamma_regularizer": null, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "name": "conv2d_5", "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "filters": 32, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"epsilon": 0.001, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "name": "batch_normalization_5", "gamma_regularizer": null, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"padding": "valid", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "max_pooling2d_2", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.6}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 128, "name": "dense_1", "use_bias": true, "kernel_regularizer": null, "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"epsilon": 0.001, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "name": "batch_normalization_6", "gamma_regularizer": null, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_3", "trainable": true, "rate": 0.6}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 7, "name": "dense_2", "use_bias": true, "kernel_regularizer": null, "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_7", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential"}